package com.example.mygame.fragment;

import android.os.Bundle;

import androidx.fragment.app.Fragment;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import com.example.mygame.R;

import java.io.File;
import java.io.FileNotFoundException;
import java.util.Scanner;


public class CountryRandomFragment extends Fragment {


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_country_random, null);

        TextView resultTv = (TextView) v.findViewById(R.id.resultTv);
        TextView randomBt = (TextView) v.findViewById(R.id.randomBt);


        randomBt.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String[] myString = new String[]{
                        "Финляндия - Хельсинки", "Албания - Тирана", "Эстония - Таллин",
                        "Швеция - Стокгольм", "Болгария - София", "Северная Македония - Скопье",
                        "Босния и Герцеговина - Сараево", "Италия - Рим",
                        "Латвия - Рига", "Исландия - Рейкьявик", "Чехия - Прага",
                        "Черногория - Подгорица", "Франция - Париж", "Норвегия - Осло", "Россия - Москва",
                        "Монако - Монако", "Белоруссия - Минск", "Испания - Мадрид",
                        "Люксембург - Люксембург", "Словения - Любляна", "Великобритания - Лондон",
                        "Португалия - Лиссабон", "Дания - Копенгаген", "Молдавия - Кишинёв",
                        "Украина - Киев", "Хорватия - Загреб",
                        "Ирландия - Дублин", "Литва - Вильнюс", "Австрия - Вена", "Ватикан - Ватикан",
                        "Польша - Варшава", "Мальта - Валлетта", "Лихтенштейн - Вадуц", "Румыния - Бухарест",
                        "Венгрия - Будапешт", "Бельгия - Брюссель", "Словакия - Братислава", "Швейцария - Берн",
                        "Германия - Берлин", "Сербия - Белград", "Греция - Афины",
                        "Нидерланды - Амстердам", "ОАЭ - Абу-Даби", "Иордания - Амман", "Турция - Анкара",
                        "Туркмения - Ашхабад", "Ирак - Багдад", "Азербайджан - Баку", "Таиланд - Бангкок",
                        "Ливан - Бейрут", "Киргизия - Бишкек", "Лаос - Вьентьян",
                        "Бангладеш - Дакка", "Сирия - Дамаск", "Индия - Индия - Дели", "Индонезия - Джакарта",
                        "Восточный - Тимор - Дили", "Катар - Доха", "Таджикистан - Душанбе", "Армения - Ереван",
                        "Израиль - Иерусалим", "Пакистан - Исламабад", "Афганистан - Кабул", "Непал - Катманду",
                        "Малайзия - Куала-Лумпур", "Мальдивы - Мале", "Бахрейн	Манама", "Филиппины - Манила",
                        "Оман - Маскат", "Мьянма - Нейпьидо", "Кипр - Никосия", "Казахстан - Нур-Султан",
                        "Китай - Пекин", "Камбоджа - Пномпень", "КНДР - Пхеньян", "Йемен - Сана",
                        "Республика - Корея - Сеул", "Сингапур - Сингапур", "Узбекистан - Ташкент", "Грузия - Тбилиси",
                        "Иран - Тегеран", "Япония - Токио", "Бутан - Тхимпху", "Монголия - Улан-Батор",
                        "Вьетнам	Ханой", "Кувейт - Эль-Кувейт",
                        "Нигерия - Абуджа", "Эфиопия - Аддис-Абеба", "Гана - Аккра", "Алжир - Алжир",
                        "Мадагаскар - Антананариву", "Эритрея - Асмэра", "Мали - Бамако", "ЦАР - Банги", "Гамбия - Банжул",
                        "Гвинея Бисау - Бисау", "Республика Конго - Браззавиль", "Сейшельские Острова - Виктория",
                        "Намибия - Виндхук", "Ботсвана - Габороне", "Бурунди - Гитега", "Сенегал - Дакар",
                        "Джибути	Джибути", "Южный - Судан - Джуба", "Танзания - Додома",
                        "Египет - Каир", "Уганда - Кампала", "Руанда - Кигали", "Конго - Киншаса",
                        "Гвинея - Конакри", "Габон - Либревиль", "Малави - Лилонгве", "Ангола - Луанда",
                        "Замбия - Лусака", "Экваториальная - Гвинея - Малабо", "Мозамбик - Мапуту",
                        "Лесото - Масеру", "Эсватини - Мбабане", "Сомали - Могадишо", "Либерия - Монровия",
                        "Коморы - Морони", "Кения - Найроби", "Чад - Нджамена", "Нигер - Ниамей",
                        "Мавритания - Нуакшот", "Маврикий - Порт-Луи", "Бенин - Порто-Ново",
                        "ЮАР - Претория", "Марокко	Рабат",
                        "Ливия - Триполи", "Тунис - Тунис", "Зимбабве - Хараре", "Судан - Хартум"
                };
                int n = (int)Math.floor(Math.random() * myString.length);
                resultTv.setText(myString[n]);
            }
        });

        return v;
    }
}